In [73]:
import pandas as pd
import numpy as np

# missing data

In [74]:
d = {
    'A': [10, np.nan,40],
    'B':[np.nan,15, np.nan],
    'C':[20,30,25]
}

In [75]:
df = pd.DataFrame(d)

In [76]:
df

      A     B   C
0  10.0   NaN  20
1   NaN  15.0  30
2  40.0   NaN  25

## Drop Nan Method

In [77]:
df.dropna()

Empty DataFrame
Columns: [A, B, C]
Index: []

In [78]:
df.dropna(axis = 0)

Empty DataFrame
Columns: [A, B, C]
Index: []

In [79]:
df.dropna(axis = 1)

    C
0  20
1  30
2  25

## Filling Value

In [80]:
df

      A     B   C
0  10.0   NaN  20
1   NaN  15.0  30
2  40.0   NaN  25

In [81]:
df.fillna(value = 'Filling Value')

               A              B   C
0           10.0  Filling Value  20
1  Filling Value           15.0  30
2           40.0  Filling Value  25

In [82]:
df = pd.DataFrame(d)

In [83]:
a = df['A'].fillna(value = df['A'].mean())

In [84]:
df

      A     B   C
0  10.0   NaN  20
1   NaN  15.0  30
2  40.0   NaN  25

In [85]:
a

0    10.0
1    25.0
2    40.0
Name: A, dtype: float64

In [86]:
df

      A     B   C
0  10.0   NaN  20
1   NaN  15.0  30
2  40.0   NaN  25

In [87]:
df['A'].fillna(value = df['A'].mean())

0    10.0
1    25.0
2    40.0
Name: A, dtype: float64

In [88]:
df

      A     B   C
0  10.0   NaN  20
1   NaN  15.0  30
2  40.0   NaN  25

In [89]:
df.fillna

<bound method NDFrame.fillna of       A     B   C
0  10.0   NaN  20
1   NaN  15.0  30
2  40.0   NaN  25>

In [90]:
df['A'].fillna(value = df['A'].mean(), inplace = True)

In [91]:
df

      A     B   C
0  10.0   NaN  20
1  25.0  15.0  30
2  40.0   NaN  25

# Group By

In [92]:
data = {
    'Company':['Tata', 'Tata', 'CTS', 'META','APPLE','IBM'],
    'Person': ['Alice','Bob','Charlie','David','Emma','Francis'],
    'Sales': [210, 235, 750, 874, 300, 400]
}

In [93]:
df = pd.DataFrame(data)

In [94]:
df

  Company   Person  Sales
0    Tata    Alice    210
1    Tata      Bob    235
2     CTS  Charlie    750
3    META    David    874
4   APPLE     Emma    300
5     IBM  Francis    400

In [95]:
byComp = df.groupby('Company')

In [96]:
byComp.sum()

           Person  Sales
Company
APPLE        Emma    300
CTS       Charlie    750
IBM       Francis    400
META        David    874
Tata     AliceBob    445

In [97]:
df

  Company   Person  Sales
0    Tata    Alice    210
1    Tata      Bob    235
2     CTS  Charlie    750
3    META    David    874
4   APPLE     Emma    300
5     IBM  Francis    400

In [98]:
df.groupby('Company').count()

         Person  Sales
Company
APPLE         1      1
CTS           1      1
IBM           1      1
META          1      1
Tata          2      2

In [99]:
df

  Company   Person  Sales
0    Tata    Alice    210
1    Tata      Bob    235
2     CTS  Charlie    750
3    META    David    874
4   APPLE     Emma    300
5     IBM  Francis    400

In [100]:
df.groupby('Company').describe()

        Sales
        count   mean       std    min     25%    50%     75%    max
Company
APPLE     1.0  300.0       NaN  300.0  300.00  300.0  300.00  300.0
CTS       1.0  750.0       NaN  750.0  750.00  750.0  750.00  750.0
IBM       1.0  400.0       NaN  400.0  400.00  400.0  400.00  400.0
META      1.0  874.0       NaN  874.0  874.00  874.0  874.00  874.0
Tata      2.0  222.5  17.67767  210.0  216.25  222.5  228.75  235.0

# Merging, Joining and Concatenating

## Concatenating

In [101]:
df1 = pd.DataFrame(np.random.randint(1, 20, size = (4, 3)), [1,2,3,4], ['W', 'X', 'Y'])

In [102]:
df2 = pd.DataFrame(np.random.randint(20,40, size = (4, 3)), [5,6,7,8], ['W', 'X', 'Y'])

In [103]:
df3 = pd.DataFrame(np.random.randint(40,60, size = (4, 3)), [9,10,11,12], ['W', 'X', 'Y'])

In [104]:
df1

    W   X   Y
1  17  14  19
2   2   6   9
3   3   2   4
4   9  18  16

In [105]:
df2

    W   X   Y
5  38  22  20
6  39  30  23
7  22  26  26
8  25  25  31

In [106]:
df3

     W   X   Y
9   52  41  57
10  54  54  41
11  56  50  56
12  55  52  51

In [107]:
farme = [df1, df2, df3]

In [108]:
pd.concat(farme)

     W   X   Y
1   17  14  19
2    2   6   9
3    3   2   4
4    9  18  16
5   38  22  20
6   39  30  23
7   22  26  26
8   25  25  31
9   52  41  57
10  54  54  41
11  56  50  56
12  55  52  51

In [109]:
pd.concat(farme, axis = 1)

       W     X     Y     W     X     Y     W     X     Y
1   17.0  14.0  19.0   NaN   NaN   NaN   NaN   NaN   NaN
2    2.0   6.0   9.0   NaN   NaN   NaN   NaN   NaN   NaN
3    3.0   2.0   4.0   NaN   NaN   NaN   NaN   NaN   NaN
4    9.0  18.0  16.0   NaN   NaN   NaN   NaN   NaN   NaN
5    NaN   NaN   NaN  38.0  22.0  20.0   NaN   NaN   NaN
6    NaN   NaN   NaN  39.0  30.0  23.0   NaN   NaN   NaN
7    NaN   NaN   NaN  22.0  26.0  26.0   NaN   NaN   NaN
8    NaN   NaN   NaN  25.0  25.0  31.0   NaN   NaN   NaN
9    NaN   NaN   NaN   NaN   NaN   NaN  52.0  41.0  57.0
10   NaN   NaN   NaN   NaN   NaN   NaN  54.0  54.0  41.0
11   NaN   NaN   NaN   NaN   NaN   NaN  56.0  50.0  56.0
12   NaN   NaN   NaN   NaN   NaN   NaN  55.0  52.0  51.0

## Merging

In [110]:
left = {
    'key':['k0','k1','k2','k3'],
    'A':[10,20,30,40],
    'B':[1,2,3,4]
}

In [111]:
right = {
    'key':['k0','k1','k2','k3'],
    'C':[100,200,300,400],
    'D':[11,12,13,14]
}

In [112]:
left = pd.DataFrame(left)

In [113]:
right = pd.DataFrame(right)

In [114]:
left

  key   A  B
0  k0  10  1
1  k1  20  2
2  k2  30  3
3  k3  40  4

In [115]:
right

  key    C   D
0  k0  100  11
1  k1  200  12
2  k2  300  13
3  k3  400  14

In [116]:
pd.merge(left, right, on='key')

  key   A  B    C   D
0  k0  10  1  100  11
1  k1  20  2  200  12
2  k2  30  3  300  13
3  k3  40  4  400  14

In [117]:
pd.merge

<function pandas.core.reshape.merge.merge(left: 'DataFrame | Series', right: 'DataFrame | Series', how: 'MergeHow' = 'inner', on: 'IndexLabel | AnyArrayLike | None' = None, left_on: 'IndexLabel | AnyArrayLike | None' = None, right_on: 'IndexLabel | AnyArrayLike | None' = None, left_index: 'bool' = False, right_index: 'bool' = False, sort: 'bool' = False, suffixes: 'Suffixes' = ('_x', '_y'), copy: 'bool | None' = None, indicator: 'str | bool' = False, validate: 'str | None' = None) -> 'DataFrame'>

## Joining

In [118]:
left = {
    'A':['A0','A1','A2'],
    'B':['B0','B1','B2']
}

In [119]:
right = {
    'C':['C0','C2','C3'],
    'D':['D0','D2','D3']
}

In [120]:
left = pd.DataFrame(left, index = ['k0','k1','k2'])

In [121]:
right = pd.DataFrame(right, index = ['k0','k2','k3'])

In [122]:
left

     A   B
k0  A0  B0
k1  A1  B1
k2  A2  B2

In [123]:
right

     C   D
k0  C0  D0
k2  C2  D2
k3  C3  D3

In [124]:
left.join(right, how = 'inner')

     A   B   C   D
k0  A0  B0  C0  D0
k2  A2  B2  C2  D2

In [125]:
left.join

<bound method DataFrame.join of      A   B
k0  A0  B0
k1  A1  B1
k2  A2  B2>

# Operations

In [126]:
df = pd.DataFrame({
    'col1':[444,555,666,444],
    'col2':[1,2,3,4],
    'col3':['abc','def','ghi','xyz']
})

In [127]:
df

   col1  col2 col3
0   444     1  abc
1   555     2  def
2   666     3  ghi
3   444     4  xyz

In [128]:
df['col1'].unique()

array([444, 555, 666])

In [129]:
df['col1'].nunique()

3

In [130]:
df['col1'].value_counts()

col1
444    2
555    1
666    1
Name: count, dtype: int64

## Apply Method

In [131]:
def times2(x):
    return 2*x

In [132]:
df['col2'].apply(times2)

0    2
1    4
2    6
3    8
Name: col2, dtype: int64

In [133]:
df['col2'].apply(lambda x: x**2)

0     1
1     4
2     9
3    16
Name: col2, dtype: int64

# Reading File

In [135]:
df

   col1  col2 col3
0   444     1  abc
1   555     2  def
2   666     3  ghi
3   444     4  xyz

In [136]:
df.head(10)

   col1  col2 col3
0   444     1  abc
1   555     2  def
2   666     3  ghi
3   444     4  xyz

In [137]:
df.tail()

   col1  col2 col3
0   444     1  abc
1   555     2  def
2   666     3  ghi
3   444     4  xyz

In [138]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [139]:
df.columns.to_list()

['col1', 'col2', 'col3']

In [140]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [141]:
df.nunique()

col1    3
col2    4
col3    4
dtype: int64

In [142]:
df.head()

   col1  col2 col3
0   444     1  abc
1   555     2  def
2   666     3  ghi
3   444     4  xyz

In [144]:
df.head()

   col1  col2 col3
0   444     1  abc
1   555     2  def
2   666     3  ghi
3   444     4  xyz

In [146]:
df.head()

   col1  col2 col3
0   444     1  abc
1   555     2  def
2   666     3  ghi
3   444     4  xyz